

#副词条权重字典
equip_res=dict()
res_skill_list=[]

def init_equip_res_dict():
    res_map = [
        ('小生命', 100),
        ('小攻击', 100),
        ('小防御', 100),
        ('大生命', 100),
        ('大攻击', 100),
        ('大防御', 100),
        ('速度', 40),
        ('暴击', 60),
        ('暴伤', 60),
        ('效果抵抗', 100),
        ('效果命中', 100),
        ('击破', 100)
    ]
    for name, p in res_map:
        equip_res[name] = p
        res_skill_list.append(name)


def cal_p(use_name_list,res_name_list,equip_name_weight_dict):

    return

def main():
    q=[(['速度', '大攻击', '暴击', '暴伤'], ['小攻击', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破']),
       (['速度', '大攻击', '暴击', '暴伤'],['小生命', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破']),
       (['速度', '大攻击', '暴伤'] ,['小生命', '小攻击', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破']),
       (['速度', '暴击', '暴伤'] ,['小生命', '小攻击', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破']),
       (['速度', '大攻击', '暴击', '暴伤'], ['小生命', '小攻击', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破']),
       (['速度', '暴击', '暴伤'], ['小生命', '小攻击', '小防御', '大生命', '大防御', '效果抵抗', '效果命中', '击破'])]

    for quse,qres in q:
        cal_p3(quse,qres,equip_res)

    return


if __name__ == "__main__":
    main()